improved doc diagram
